{
    "title": "Oinktech",
    "homeLink": "Oinktech",
    "and":"and",
    "title about us": "About Us - Oinktech",
    "Already online":"Already online🥳",
    "workDisplay": "Work display",
    "aboutUs": "About Us",
    "contactUs": "Contact Us",
    "commentUs": "Comment Us",
    "latestNews": "🥳 Latest News",
    "welcome": "Welcome to Oinktech!",
    "heroText": "We are Oinktech, an innovative company dedicated to providing cutting-edge technology solutions.",
    "webDevelopment": "Web Development",
    "webDevelopmentText": "From beautiful website designs to efficient front-end and back-end development, we help your business stand out online.",
    "mobileDevelopment": "Mobile App Development",
    "mobileDevelopmentText": "Create feature-rich and user-friendly mobile apps to enhance your business operations.",
    "dataAnalysis": "Data Analysis",
    "dataAnalysisText": "Provide in-depth data analysis and reports to help you make informed decisions.",
    "selectLanguage": "Select language:",
    "footerText": "© 2024 All rights reserved by Oinktech.",
    "Aboutus" :"Oinktech Founded in 2024, we are a company focused on cutting-edge technology. Since our establishment, we have been committed to helping customers achieve their business goals through innovative technology and professional services.",
    "our mission" : "Our mission",
    "Our mission" : "Our mission is to provide the highest quality technology solutions to help customers maintain a competitive advantage in a rapidly changing digital world. We ensure that every project can achieve the best results by constantly exploring new technologies and improving the professional skills of our team.",
    "our team":"Our team",
    "Our team":"Our team is composed of a group of passionate and experienced professionals. Each member has deep professional knowledge and rich practical experience in their own field. We value innovation, cooperation and customer satisfaction , and integrate these core values ​​into our work.",
    "choose us" :"Why choose us",
    "Choose us 1-1":"Professional technology",
    "Choose us 1-2":"We have many years of industry experience and can provide you with high-quality technical solutions",
    "Choose us 2-1":"Customer first",
    "Choose us 2-2":"We are customer-oriented and provide customized services to ensure your satisfaction",
    "Choose us 3-1":"Innovation-driven",
    "Choose us 3-2":"We continue to explore and introduce the latest technology to maintain our leading position in the industry",
    "Choose us 4-1":"Reliable Support",
    "Choose us 4-2":"We provide comprehensive technical support to ensure that you have no worries when using our services",
    "cooperate" :"We look forward to working with you to realize your technology vision. If you have any questions or needs, please feel free to contact us",
    "title Code Architect Studio":"Code Architect Studio - Oinktech",
    "portfolioTitle code": "Code Architect Studio",
    "visitLinkText code": "Visit Code Architect Studio",
    "overviewTitle": "Overview",
    "overviewText": "Code Architect Studio is an interactive web application designed to provide developers with a collaborative coding and development environment. This platform allows users to write, test, and share code online, making it particularly useful for those who want to quickly prototype ideas or collaborate with others.",
    "keyFeaturesTitle": "Key Features",
    "Code Editor" :"Code Editor: Provides an intuitive code editor supporting various programming languages, with features like syntax highlighting and auto-completion.",
    "Real-Time Preview" :"Real-Time Preview: Allows users to instantly see the results of their code, aiding in rapid prototyping and testing.",
    "Sharing Functionality" :"Sharing Functionality: Enables easy sharing of code via generated links, facilitating collaboration and feedback.",
    "Version Control" :"Version Control: Offers basic version control, allowing users to save different versions of their code for easy management and rollback.",
    "technicalDetailsTitle" :"Technical Details.",
    "Frontend Technologies":"Frontend Technologies: Utilizes modern frontend technologies like React.js and Webpack for high performance and user experience.",
    "Backend Technologies" : "Backend Technologies: Supports backend interactions for saving execution results and managing code versions, offering a comprehensive development environment.",
    "usageFlowTitle": "Usage Flow",
      "usageFlow1":  "Users enter the site and choose to create a new coding project.",
       "usageFlow2": "They write code in the editor and see the output immediately.",
        "usageFlow3":"Users can save their code or generate a shareable link to collaborate with others.",
        "usageFlow4":"They can use version control to manage and view the history of their code.",
    "title-comment": "Comment Us - Oinktech",
    "hyvorTalkComments": {
        "websiteId": "11803",
        "pageId": ""
  },
    "title contact": "Contact Us - Oinktech",
    "contact":"Contact Us",

        "nameLabel": "Name:",
        "emailLabel": "Email:",
        "messageLabel": "Message:",
        "submitButton": "Send Message",
    "title firebase-login-system": "Firebase Login System - Oinktech",
    "title Firebase-login-system": "Firebase Login System",
    "visitLink": "Visit Firebase Login System",
      "header-1": "Overview",
      "text1": "The Firebase Login System is a demonstration of implementing user authentication using Firebase. Firebase, a comprehensive backend-as-a-service (BaaS) provided by Google, is widely used for developing mobile and web applications. This example showcases how Firebase can facilitate secure user authentication, supporting various sign-in methods including Google, GitHub, and email/password.",
      "header-2": "Key Features",
        "text2":"Multiple Sign-In Options: Offers various sign-in options such as Google, GitHub, and traditional email/password authentication, all integrated using Firebase Authentication services.",
        "text3" :"User Management: Displays user information (email and UID) after login and provides functionalities for password changes and logout.",
        "text4" :"Security: Utilizes Firebase Authentication to handle user credentials securely, ensuring data protection and preventing unauthorized access.",
      "header-3": "Technical Details",
       "text5" : "Frontend Technologies: Built using HTML, CSS, and JavaScript, offering a clean and user-friendly interface.",
       "text6" : "Backend Technologies: Uses Firebase’s authentication services to manage user accounts and authentication processes.",
      "header-4": "Usage Flow",
       "text7" : "Create a Firebase project.",
        "text8" :"Enable Google and Email login in Firebase Authentication.",
        "text9" :"Enter the relevant configuration of Firebase.",
        "text10" :"Generate and download links.",
        "text11" :"Ready to use after deployment.",
        "title oinktech-cloud": "Oinktech-Cloud 雲端系統 - Oinktech",
        "title Oinktech Cloud": "Oinktech Cloud",
        "visitLink oinktech cloud": "Visit Oinktech Cloud",
  "header-5": "Overview",
  "text12": "Oinktech Cloud is a cloud service platform designed to provide various tools and services for users needing reliable cloud storage and collaboration features. The platform aims to meet the needs of both individuals and businesses by offering a scalable, secure, and user-friendly environment for managing and sharing files online.",
  "header-6": "Key Features",
  "text13": "Cloud Storage: Oinktech Cloud provides a secure and scalable cloud storage solution, allowing users to easily store and manage files. Users can upload, download, and organize files within a structured and intuitive interface.",
  "text14": "File Sharing: The platform supports easy file sharing. Users can generate shareable links to specific files or folders, simplifying the collaboration process.",
  "text15": "Collaboration Tools: Oinktech Cloud includes real-time collaboration tools. Users can work together on documents, spreadsheets, and other types of files, with all collaborators' changes reflected instantly.",
  "text16": "Security: The platform emphasizes security, offering robust data protection features. Files stored on Oinktech Cloud are encrypted, and access controls ensure that only authorized users can access sensitive information.",
  "text17": "Accessibility: Oinktech Cloud is accessible from any device with an internet connection. This cross-platform compatibility ensures that users can access their files and collaborate from anywhere at any time.",
  "header-7": "Technical Details",
  "text18": "Frontend Technology: The user interface is built using modern web technologies, including HTML, CSS, and JavaScript, providing a responsive and interactive user experience.",
  "text19": "Backend Technology: Oinktech Cloud utilizes cloud-based infrastructure to handle storage, file management, and security. The backend is designed to be scalable, ensuring reliable performance even when handling large amounts of data.",
  "text20": "Security Technology: Advanced encryption methods are used to protect user data, and secure authentication mechanisms are implemented to verify user identities and manage access controls.",
  "header-8": "Usage Flow",
  "text21": "Users register for an Oinktech Cloud account and log in to access the platform.",
  "text22": "They can upload files to their personal cloud storage, organize them into folders, and manage them as needed.",
  "text23": "To share files, users can generate shareable links or invite collaborators directly, providing them with appropriate access permissions.",
  "text24": "Collaborators can view, edit, or comment on shared files, depending on the permissions granted by the file owner.",
  "text25": "All operations use encryption and access controls to maintain the privacy and integrity of user data.",
  "title portfolio": "Work Display - Oinktech",
"title portfolio2": "Portfolio",
  "title1": "Code Architecture Studio",
  "image1": "./images/title.png",
  "link1": "",
  "title2": "Auto-Generated Firebase Login System",
  "image2": "./images/firebase-title.png",
  "link2": "",
  "title3": "Oinktech-Cloud Cloud Service",
  "image3": "./images/cloud.png",
  "link3": "",
  "title4": "Auto-Deploy Local HTML",
  "link4": "Download Auto-Deploy Local HTML",
  "description1": "Instructions: First, manually add environment variables. Then, enter 'html' in the terminal to generate a local link.",
  "title5": "Local Clone of GitHub Repository",
  "link5": "Download Local Clone of GitHub Repository",
  "description2": "Instructions: First, manually add environment variables. Then, enter 'github_clone' or 'clone' in the terminal and follow the prompts.",
  "title6": "GitHub Push Tool",
  "link6": "Download GitHub Push Tool",
  "description3": "Instructions: First, manually add environment variables. Then, enter 'push' or 'github_push' in the terminal to generate a local link.",
  "title7": "File Encryption Tool",
  "link7": "Download File Encryption Tool",
  "title8": "Display Folder Directory",
  "link8": "Download Display Folder Directory Tool",
  "description4": "Instructions: Manually add to environment variables, enter 'show_folder' in the terminal, and follow the prompts.",
    "title100": "Privacy Policy",
    "privacyPolicy": {
        "title": "Privacy Policy",
        "intro": "Welcome to Oinktech. We are committed to protecting and respecting your privacy. This privacy policy explains how we collect, use, and protect your personal information.",
        "section1": {
            "title": "1. Information We Collect",
            "content": "We may collect the following types of information:",
            "items": [
                "Personal Information: Including your name, email address, and contact information.",
                "Usage Data: Including the time, date, browser type, and pages you visit on our site.",
                "Cookies: We use cookies to improve your browsing experience. Cookies are small text files stored on your device."
            ]
        },
        "section2": {
            "title": "2. How We Use Your Information",
            "content": "We use your information to:",
            "items": [
                "Provide and improve our services.",
                "Process your requests and inquiries.",
                "Send you notifications and updates about our products and services."
            ]
        },
        "section3": {
            "title": "3. How We Protect Your Information",
            "content": "We take appropriate technical and organizational measures to protect your personal information from unauthorized access, disclosure, alteration, or destruction. We regularly review and update our security measures."
        },
        "section4": {
            "title": "4. How We Share Your Information",
            "content": "We do not sell or rent your personal information to third parties. We may share your information in the following situations:",
            "items": [
                "When required by law, or to comply with legal processes.",
                "With our service providers or partners to help us provide our services."
            ]
        },
        "section5": {
            "title": "5. Your Rights",
            "content": "You have the right to request access to, correction, or deletion of your personal information. If you wish to exercise these rights, please contact us."
        },
        "section6": {
            "title": "6. Changes to Privacy Policy",
            "content": "We may update this privacy policy from time to time. Any changes will be posted on this page, and you will be notified via email before the changes take effect."
        },
        "section7": {
            "title": "7. Contact Us",
            "content": "If you have any questions or concerns about this privacy policy, please contact us at:",
            "contactEmail": "Email: oinktech2024@gmail.com"
        }
    },
  "gpqar-title": "GitHub Project Query and Recommendation - Detailed Guide - Oinktech",
  "section-intro-title": "Website Introduction",
  "section-intro-content": "The GitHub Project Query and Recommendation system is an application based on the GitHub API, designed to help developers quickly search and discover valuable open-source projects. The tool offers three main features: project search, project recommendations, and trending projects.",
  "section-features-title": "Main Features",
  "section-features-search": "1. Project Search: Users can input keywords to search for open-source projects on GitHub. The system will return matching projects based on the user's keywords and display them in a list.",
  "section-features-recommend": "2. Project Recommendations: Based on the user’s search history or predefined tags, the system will automatically recommend relevant open-source projects to help users discover more.",
  "section-features-trending": "3. Trending Projects: Displays the most popular projects on GitHub, allowing users to quickly view the latest open-source trends.",
  "section-usage-title": "How to Use",
  "section-usage-step1": "Step 1: On the homepage, you will find three function buttons: 'Search Projects', 'Recommended Projects', and 'Trending Projects'.",
  "section-usage-step2": "Step 2: Click 'Search Projects', enter the project name or keyword you are interested in, then click 'Search'. Results will be displayed below.",
  "section-usage-step3": "Step 3: Click 'Recommended Projects', and the system will automatically suggest relevant open-source projects.",
  "section-usage-step4": "Step 4: Click 'Trending Projects' to view the currently trending projects on GitHub.",
  "section-tech-title": "Technical Details",
  "section-tech-content": "This website is primarily built using HTML, CSS, and JavaScript for the front end, and utilizes the GitHub API to fetch project data. The interface is simple, responsive, and works well across various devices.",
  "section-contribute-title": "How to Contribute",
  "section-contribute-content": "If you are interested in contributing or submitting issues, please visit the project’s GitHub repository: GitHub Project Query and Recommendation."

}
    
