{
    "title about us": "Sobre nosotros - Oinktech",
    "Already online": "隆Ya est谩 en l铆neaコ!",
    "workDisplay": "Exhibici贸n de trabajos",
    "aboutUs": "Sobre nosotros",
    "contactUs": "Cont谩ctanos",
    "commentUs": "Deja un comentario",
    "latestNews": "コltimas noticias",
    "welcome": "隆Bienvenido a Oinktech!",
    "heroText": "Somos Oinktech, una empresa innovadora que ofrece soluciones tecnol贸gicas de vanguardia.",
    "webDevelopment": "Desarrollo web",
    "webDevelopmentText": "Desde el dise帽o de sitios web elegantes hasta el desarrollo eficiente de frontend y backend, te ayudamos a destacar tu negocio en l铆nea.",
    "mobileDevelopment": "Desarrollo de aplicaciones m贸viles",
    "mobileDevelopmentText": "Desarrollamos aplicaciones m贸viles ricas en funciones y f谩ciles de usar para mejorar la eficiencia operativa de tu negocio.",
    "dataAnalysis": "An谩lisis de datos",
    "dataAnalysisText": "Proporcionamos an谩lisis y reportes de datos profundos para ayudarte a tomar decisiones informadas.",
    "selectLanguage": "Selecciona idioma",
    "footerText": "Copyright 漏 2024 Oinktech",
    "Aboutus": "Oinktech fue fundada en 2024 y se centra en la tecnolog铆a de vanguardia. Desde su creaci贸n, hemos apoyado a nuestros clientes en la consecuci贸n de sus objetivos empresariales mediante soluciones tecnol贸gicas innovadoras y servicios profesionales.",
    "our mission": "Nuestra misi贸n",
    "Our mission": "Nuestra misi贸n es ofrecer las mejores soluciones tecnol贸gicas para ayudar a nuestros clientes a mantenerse competitivos en el mundo digital en constante cambio. Exploramos continuamente nuevas tecnolog铆as y mejoramos la experiencia de nuestro equipo para asegurar que cada proyecto logre los mejores resultados posibles.",
    "our team": "Nuestro equipo",
    "Our team": "Nuestro equipo est谩 compuesto por profesionales apasionados y experimentados. Cada miembro del equipo posee conocimientos profundos y experiencia pr谩ctica en su campo. Valoramos la innovaci贸n, la colaboraci贸n y la satisfacci贸n del cliente, y estos valores fundamentales se reflejan en nuestro trabajo.",
    "choose us": "驴Por qu茅 elegirnos?",
    "Choose us 1-1": "Tecnolog铆a experta",
    "Choose us 1-2": "Ofrecemos soluciones tecnol贸gicas de alta calidad a trav茅s de a帽os de experiencia en la industria.",
    "Choose us 2-1": "Enfoque en el cliente",
    "Choose us 2-2": "Proporcionamos servicios personalizados centrados en las necesidades del cliente para garantizar tu satisfacci贸n.",
    "Choose us 3-1": "Liderazgo en innovaci贸n",
    "Choose us 3-2": "Exploramos y adoptamos continuamente nuevas tecnolog铆as para mantener una posici贸n de liderazgo en la industria.",
    "Choose us 4-1": "Soporte confiable",
    "Choose us 4-2": "Ofrecemos soporte t茅cnico integral para que puedas usar nuestros servicios sin preocupaciones.",
    "cooperate": "Esperamos colaborar contigo para hacer realidad tu visi贸n tecnol贸gica. Si tienes preguntas o necesidades, no dudes en contactarnos.",
    "title Code Architect Studio": "Code Architect Studio - Oinktech",
    "portfolioTitle code": "Code Architect Studio",
    "visitLinkText code": "Visitar Code Architect Studio",
    "overviewTitle": "Visi贸n general",
    "overviewText": "Code Architect Studio es una aplicaci贸n web interactiva que proporciona un entorno de programaci贸n colaborativa para desarrolladores. Esta plataforma permite a los usuarios escribir, probar y compartir c贸digo en l铆nea, ideal para prototipado r谩pido o colaboraci贸n con otros.",
    "keyFeaturesTitle": "Caracter铆sticas clave",
    "Code Editor": "Editor de c贸digo: Proporciona un editor de c贸digo intuitivo, compatible con varios lenguajes de programaci贸n y con funciones de resaltado de sintaxis y autocompletado.",
    "Real-Time Preview": "Vista previa en tiempo real: Permite a los usuarios ver los resultados del c贸digo de inmediato, facilitando el prototipado r谩pido y las pruebas.",
    "Sharing Functionality": "Funcionalidad de compartici贸n: Facilita compartir el c贸digo generado mediante un enlace para simplificar la colaboraci贸n y la retroalimentaci贸n.",
    "Version Control": "Control de versiones: Ofrece funciones b谩sicas de control de versiones para guardar y gestionar diferentes versiones del c贸digo y facilitar la reversi贸n.",
    "technicalDetailsTitle": "Detalles t茅cnicos",
    "Frontend Technologies": "Tecnolog铆as frontend: Utiliza tecnolog铆as modernas como React.js y Webpack para ofrecer un rendimiento alto y una buena experiencia de usuario.",
    "Backend Technologies": "Tecnolog铆as backend: Gestiona la interacci贸n backend para almacenar resultados y controlar versiones de c贸digo, ofreciendo un entorno de desarrollo completo.",
    "usageFlowTitle": "Flujo de uso",
    "usageFlow1": "Los usuarios crean un nuevo proyecto de programaci贸n al acceder al sitio web.",
    "usageFlow2": "Escriben c贸digo en el editor y ven los resultados de inmediato.",
    "usageFlow3": "Pueden guardar el c贸digo o generar un enlace compartible para colaborar con otros.",
    "usageFlow4": "Usan el control de versiones para gestionar y revisar el historial del c贸digo.",
    "title-comment": "Deja un comentario - Oinktech",
    "hyvorTalkComments": {
      "websiteId": "11803",
      "pageId": ""
    },
    "title contact": "Contacto - Oinktech",
    "contact": "Contacto",
    "nameLabel": "Nombre:",
    "emailLabel": "Correo electr贸nico:",
    "messageLabel": "Mensaje:",
    "submitButton": "Enviar mensaje",
    "title firebase-login-system": "Sistema de inicio de sesi贸n de Firebase - Oinktech",
    "title Firebase-login-system": "Sistema de inicio de sesi贸n de Firebase",
    "visitLink": "Visitar sistema de inicio de sesi贸n de Firebase",
    "header-1": "Visi贸n general",
    "text1": "El sistema de inicio de sesi贸n de Firebase demuestra c贸mo implementar autenticaci贸n de usuarios utilizando Firebase. Firebase es un servicio de backend integral proporcionado por Google, ampliamente utilizado en el desarrollo de aplicaciones m贸viles y web. Este ejemplo muestra c贸mo Firebase admite una variedad de m茅todos de inicio de sesi贸n, incluyendo Google, GitHub y correo electr贸nico/contrase帽a, proporcionando autenticaci贸n segura de usuarios.",
    "header-2": "Caracter铆sticas clave",
    "text2": "Opciones de inicio de sesi贸n diversas: Proporciona varias opciones de inicio de sesi贸n, incluyendo Google, GitHub y autenticaci贸n tradicional por correo electr贸nico/contrase帽a, todas integradas en el servicio de autenticaci贸n de Firebase.",
    "text3": "Gesti贸n de usuarios: Muestra la informaci贸n del usuario (correo electr贸nico y UID) despu茅s del inicio de sesi贸n y proporciona funciones para cambiar contrase帽as y cerrar sesi贸n.",
    "text4": "Seguridad: Utiliza Firebase Authentication para manejar las credenciales de usuario de manera segura, garantizando la protecci贸n de datos y evitando accesos no autorizados.",
    "header-3": "Detalles t茅cnicos",
    "text5": "Tecnolog铆as frontend: Construido con HTML, CSS y JavaScript, proporcionando una interfaz de usuario limpia y amigable.",
    "text6": "Tecnolog铆as backend: Utiliza los servicios de autenticaci贸n de Firebase para gestionar cuentas de usuario y procesos de autenticaci贸n.",
    "header-4": "Flujo de uso",
    "text7": "Crea un proyecto en Firebase.",
    "text8": "Activa las opciones de inicio de sesi贸n con Google y correo electr贸nico en Firebase Authentication.",
    "text9": "Introduce la configuraci贸n relevante de Firebase.",
    "text10": "Genera y descarga el enlace.",
    "text11": "Listo para usar inmediatamente despu茅s de la implementaci贸n.",
    "title oinktech-cloud": "Sistema en la nube Oinktech-Cloud - Oinktech",
    "title Oinktech Cloud": "Oinktech Cloud",
    "visitLink oinktech cloud": "Visitar Oinktech Cloud",
    "header-5": "Visi贸n general",
    "text12": "Oinktech Cloud es una plataforma de servicios en la nube que proporciona herramientas y servicios diversos para usuarios que necesitan almacenamiento en la nube confiable y funciones de colaboraci贸n. Dise帽ado para satisfacer las necesidades de usuarios individuales y empresas, este sistema ofrece un entorno en l铆nea seguro, escalable y amigable para gestionar y compartir archivos.",
    "header-6": "Caracter铆sticas clave",
    "text13": "Almacenamiento en la nube: Ofrece una soluci贸n de almacenamiento en la nube segura y escalable, permitiendo a los usuarios almacenar y gestionar archivos f谩cilmente. Los usuarios pueden cargar, descargar y organizar archivos en una interfaz estructurada e intuitiva.",
    "text14": "Compartici贸n de archivos: Facilita compartir archivos con facilidad. Los usuarios pueden crear enlaces compartibles para archivos o carpetas espec铆ficas, simplificando la colaboraci贸n.",
    "text15": "Herramientas de colaboraci贸n: Incluye herramientas de colaboraci贸n en tiempo real, permitiendo a los usuarios trabajar juntos en documentos, hojas de c谩lculo y otros tipos de archivos, con cambios reflejados de inmediato.",
    "text16": "Seguridad: Enfatiza la seguridad con funciones avanzadas de protecci贸n de datos. Los archivos almacenados en Oinktech Cloud est谩n encriptados, y el control de acceso garantiza que solo los usuarios autorizados puedan acceder a la informaci贸n sensible.",
    "text17": "Accesibilidad: Accesible desde cualquier dispositivo con conexi贸n a red. Gracias a la compatibilidad multiplataforma, los usuarios pueden acceder a sus archivos y colaborar en cualquier momento y lugar.",
    "header-7": "Detalles t茅cnicos",
    "text18": "Tecnolog铆as frontend: Utiliza tecnolog铆as web modernas como HTML, CSS y JavaScript para construir una interfaz de usuario reactiva e interactiva.",
    "text19": "Tecnolog铆as backend: Utiliza infraestructura basada en la nube para manejar almacenamiento, gesti贸n de archivos y seguridad. El dise帽o del backend es escalable para garantizar un rendimiento fiable incluso con grandes vol煤menes de datos.",
    "text20": "Tecnolog铆as de seguridad: Utiliza m茅todos avanzados de cifrado para proteger los datos del usuario e implementa mecanismos de autenticaci贸n y control de acceso para gestionar la identidad del usuario y el acceso.",
    "header-8": "Flujo de uso",
    "text21": "Los usuarios se registran e inician sesi贸n en Oinktech Cloud para acceder a la plataforma.",
    "text22": "Suben archivos a su almacenamiento en la nube personal, los organizan en carpetas y los gestionan seg煤n sea necesario.",
    "text23": "Para compartir archivos, los usuarios pueden generar enlaces compartibles o invitar a colaboradores directamente, otorgando los permisos adecuados.",
    "text24": "Los colaboradores pueden ver, editar o comentar archivos seg煤n los permisos otorgados por el propietario del archivo.",
    "text25": "Todas las operaciones utilizan cifrado y control de acceso para mantener la privacidad e integridad de los datos del usuario.",
    "title portfolio": "Exhibici贸n de trabajos - Oinktech",
    "title portfolio2": "Exhibici贸n de trabajos",
    "title1": "Code Architect Studio",
    "image1": "./images/title.png",
    "link1": "",
    "title2": "Sistema de inicio de sesi贸n autom谩tico de Firebase",
    "image2": "./images/firebase-title.png",
    "link2": "",
    "title3": "Servicio en la nube Oinktech-Cloud",
    "image3": "./images/cloud.png",
    "link3": "",
    "title4": "Despliegue autom谩tico de HTML local",
    "link4": "Descargar despliegue autom谩tico de HTML local",
    "description1": "C贸mo usar: Primero agrega las variables de entorno manualmente, luego ingresa 'html' en la terminal para generar el enlace local.",
    "title5": "Clonaci贸n local del repositorio de Github",
    "link5": "Descargar clonaci贸n local del repositorio de Github",
    "description2": "C贸mo usar: Primero agrega las variables de entorno manualmente, luego ingresa 'github_clone' o 'clone' en la terminal y sigue las instrucciones.",
    "title6": "Herramienta de push de Github",
    "link6": "Descargar herramienta de push de Github",
    "description3": "C贸mo usar: Primero agrega las variables de entorno manualmente, luego ingresa 'push' o 'github_push' en la terminal para generar el enlace local.",
    "title7": "Herramienta de cifrado de archivos",
    "link7": "Descargar herramienta de cifrado de archivos",
    "title8": "Mostrar directorio de carpetas",
    "link8": "Descargar herramienta para mostrar directorio de carpetas",
    "description4": "C贸mo usar: Primero agrega las variables de entorno manualmente, luego ingresa 'show_folder' en la terminal y sigue las instrucciones.",
    "title100": "Pol铆tica de Privacidad",
    "privacyPolicy": {
        "title": "Pol铆tica de Privacidad",
        "intro": "Bienvenido a Oinktech. Estamos comprometidos a proteger y respetar su privacidad. Esta pol铆tica de privacidad explica c贸mo recopilamos, usamos y protegemos su informaci贸n personal.",
        "section1": {
            "title": "1. Informaci贸n que Recopilamos",
            "content": "Podemos recopilar los siguientes tipos de informaci贸n:",
            "items": [
                "Informaci贸n Personal: Incluye su nombre, direcci贸n de correo electr贸nico e informaci贸n de contacto.",
                "Datos de Uso: Incluye la hora, fecha, tipo de navegador y p谩ginas que visita en nuestro sitio.",
                "Cookies: Usamos cookies para mejorar su experiencia de navegaci贸n. Las cookies son peque帽os archivos de texto almacenados en su dispositivo."
            ]
        },
        "section2": {
            "title": "2. C贸mo Usamos su Informaci贸n",
            "content": "Usamos su informaci贸n para:",
            "items": [
                "Proveer y mejorar nuestros servicios.",
                "Procesar sus solicitudes e inquietudes.",
                "Enviar notificaciones y actualizaciones sobre nuestros productos y servicios."
            ]
        },
        "section3": {
            "title": "3. C贸mo Protegemos su Informaci贸n",
            "content": "Tomamos medidas t茅cnicas y organizativas adecuadas para proteger su informaci贸n personal contra el acceso no autorizado, divulgaci贸n, alteraci贸n o destrucci贸n. Revisamos y actualizamos nuestras medidas de seguridad regularmente."
        },
        "section4": {
            "title": "4. C贸mo Compartimos su Informaci贸n",
            "content": "No vendemos ni alquilamos su informaci贸n personal a terceros. Podemos compartir su informaci贸n en las siguientes situaciones:",
            "items": [
                "Cuando sea requerido por la ley, o para cumplir con procedimientos legales.",
                "Con nuestros proveedores de servicios o socios para ayudarnos a ofrecer nuestros servicios."
            ]
        },
        "section5": {
            "title": "5. Sus Derechos",
            "content": "Usted tiene derecho a solicitar acceso, correcci贸n o eliminaci贸n de su informaci贸n personal. Si desea ejercer estos derechos, por favor cont谩ctenos."
        },
        "section6": {
            "title": "6. Cambios en la Pol铆tica de Privacidad",
            "content": "Podemos actualizar esta pol铆tica de privacidad de vez en cuando. Cualquier cambio ser谩 publicado en esta p谩gina, y se le notificar谩 por correo electr贸nico antes de que los cambios entren en vigor."
        },
        "section7": {
            "title": "7. Cont谩ctenos",
            "content": "Si tiene alguna pregunta o inquietud sobre esta pol铆tica de privacidad, por favor cont谩ctenos en:",
            "contactEmail": "Correo electr贸nico: oinktech2024@gmail.com"
        }
    },
    "404-title": "404-P谩gina no encontrada",
    "404-p1": "隆Vaya! La p谩gina que buscas no se puede encontrar.",
    "404-p2-1": "Regresa a la ",
    "404-p2-2": "p谩gina principal",
    "404-p2-3": "o",
    "404-p2-4": "cont谩ctanos",
    "404-p2-5": "para obtener asistencia.",
    "introVideos": "Videos de Introducci贸n",
    "videoDescription1": "Video 1 - Introducci贸n a Oinktech",
    "videoDescription2": "Video 2 - Presentaci贸n del Producto Oinktech",
    
  "visit-a": "Visitar enlace",
  "ScriptSafe001": "Esta es una extensi贸n de navegador dise帽ada para mejorar la seguridad web al ofrecer varias funciones de gesti贸n de scripts, ayudando a los usuarios a controlar qu茅 scripts pueden ejecutarse en los sitios web.",
  "DarkLight001": "Esta es una aplicaci贸n web que permite a los usuarios cambiar entre temas claros y oscuros para mejorar la experiencia de lectura y adaptarse a las preferencias personales.",
  "loadingMessage": "Cargando, por favor espere...",
    "percentageLabel": "Progreso"

}
